Revit 2027 API
ExportLinetypeInfo.DestinationLinetypeName Property
 The destination linetype name (the name of the linetype in the exported format).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DestinationLinetypeName { get; set; }
Public Property DestinationLinetypeName As String
	Get
	Set
public:
property String^ DestinationLinetypeName {
	String^ get ();
	void set (String^ value);
}
member DestinationLinetypeName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace